entry = [('', 'Выберите варинт входа:'),
         ('1', 'Зарегистрироваться'),
         ('2', 'Войти в систему')]

registration = ['Введите логин:',
                'Введите пароль:',
                'Повторите ввод пароля:'
                ]

status = [('', 'Выберите ваш статус:'),
          ('1', 'Студент'),
          ('2', 'Преподаватель'),
          ('3', 'Администратор')]


login = ['Введите логин:',
         'Введите пароль:']

main = [('', 'Выберите действие:'),
        ('1', 'Просмотр расписания/ДЗ'),
        ('2', 'Редактирование ДЗ'),
        ('3', 'Редактирование расписания'),
        ('0', 'Выйти из системы')]


access_modifier = [("1", 0, 1, 4),
                   ("2", 0, 1, 2, 4),
                   ("3", 0, 1, 2, 3, 4), ]

week = [("", "Выберите день недели:"),
        ('1', 'Понедельник'),
        ('2', 'Вторник'),
        ('3', 'Среда'),
        ('4', 'Четверг'),
        ('5', 'Пятница')]

lesson_editing = [("", "Выберите действие:"),
                  ("1", "Добавить урок"),
                  ("2", "Удалить урок"),
                  ("3", "Выбрать другой день"),
                  ("4", "Выйти в основное меню"),
                  ]

home_work_editing = [("", "Выберите действие:"),
                     ("1", "Добавить ДЗ"),
                     ("2", "Удалить ДЗ"),
                     ("3", "Выбрать другой день"),
                     ("4", "Выйти в основное меню"),
                     ]


def print_(menu, limited_menu=[]):
    if limited_menu == []:
        limited_menu = [i for i in range(len(menu))]
    for i in limited_menu:
        print(end='\t')
        for j in range(len(menu[i])):
            print(menu[i][j], end=' ')
        print()
    print()


def input_(menu):
    output_list = []
    for i in range(len(menu)):
        print(menu[i], end="\t")
        output_list.append(input())
    print()
    return output_list
