'''
1. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

*Пример:*

- список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
- список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
- список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
- список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
- список: [], ищем: "123", ответ: -1
'''



from itertools import count


def find_2(lst, temp):
    count = 0
    for i in range(len(lst)):
        if temp == lst[i]:
            count = count + 1
        if count > 1:
            return i
    if count <= 1:
        return "нет"


lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
temp = "asd"
print(find_2(lst, temp))
