'''
1 2 3 4 6 7 8 9

1. В файле находится N натуральных чисел, записанных через пробел. 
   Среди чисел не хватает одного, чтобы выполнялось условие A[i] - 1 = A[i-1]. 
   Найдите это число.


2. Напишите программу, удаляющую из текста все слова, содержащие "абв". <- filter


3. Дан список чисел. Создайте список, в который попадают числа, описываемые возрастающую последовательность. 
   Порядок элементов менять нельзя.
    
    [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3] или [1, 7] или [1, 6, 7] и т.д.





1. Напишите программу, удаляющую из текста все слова, содержащие "абв".

2. Создайте программу для игры с конфетами человек против человека.

    Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.
    Первый ход определяется жеребьёвкой.
    За один ход можно забрать не более чем 28 конфет.
    Все конфеты оппонента достаются сделавшему последний ход.
    Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?

    a) Добавьте игру против бота
    b) Подумайте как наделить бота "интеллектом"

3. Создайте программу для игры в "Крестики-нолики".
 1 | 2 | 3
-----------
 X |   |
---------
  |   |

4. Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.

aaaaaaaaaaaaaaaaaaaaaabbb222aaabbwwwwcc
9a9a5a3b3a222b4w2c
aaaaaaaabbbaaabbwwwwcc

5*. Дан список чисел. Создайте список, в который попадают числа, описываемые возрастающую последовательность. Порядок элементов менять нельзя.

    [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3] или [1, 7] или [1, 6, 7] и т.д.


'''
